src/main/java/ru/vk/itmo/test/alenkovayulya/right_results/wrk-get-stable.txt
MacBook-Pro-Ulia:wrk2-arm yulalenk$ ./wrk -c 1 -d 120 -t 1 -L -R 10000 -s /Users/yulalenk/sem2/2024-highload-dht/src/main/java/ru/vk/itmo/test/alenkovayulya/lua/get.lua http://localhost:8080
Running 2m test @ http://localhost:8080
  1 threads and 1 connections
  Thread calibration: mean lat.: 1.178ms, rate sampling interval: 10ms
^[[A  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.23ms    0.98ms  22.54ms   82.90%
    Req/Sec    10.57k     1.26k   26.30k    77.74%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.11ms
 75.000%    1.73ms
 90.000%    2.18ms
 99.000%    4.03ms
 99.900%   11.73ms
 99.990%   21.25ms
 99.999%   22.25ms
100.000%   22.56ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.016     0.000000            1         1.00
       0.279     0.100000       110371         1.11
       0.501     0.200000       220135         1.25
       0.719     0.300000       330153         1.43
       0.926     0.400000       440201         1.67
       1.107     0.500000       550704         2.00
       1.169     0.550000       605641         2.22
       1.255     0.600000       660400         2.50
       1.395     0.650000       715014         2.86
       1.557     0.700000       770069         3.33
       1.725     0.750000       825181         4.00
       1.808     0.775000       852588         4.44
       1.891     0.800000       880284         5.00
       1.970     0.825000       907541         5.71
       2.047     0.850000       935293         6.67
       2.119     0.875000       962971         8.00
       2.151     0.887500       976341         8.89
       2.181     0.900000       990056        10.00
       2.209     0.912500      1003822        11.43
       2.237     0.925000      1017792        13.33
       2.271     0.937500      1032018        16.00
       2.289     0.943750      1038811        17.78
       2.309     0.950000      1045310        20.00
       2.337     0.956250      1051944        22.86
       2.377     0.962500      1058782        26.67
       2.443     0.968750      1065577        32.00
       2.503     0.971875      1069018        35.56
       2.593     0.975000      1072458        40.00
       2.727     0.978125      1075902        45.71
       2.941     0.981250      1079337        53.33
       3.271     0.984375      1082783        64.00
       3.471     0.985938      1084482        71.11
       3.635     0.987500      1086207        80.00
       3.855     0.989062      1087920        91.43
       4.183     0.990625      1089636       106.67
       4.615     0.992188      1091356       128.00
       4.911     0.992969      1092217       142.22
       5.275     0.993750      1093077       160.00
       5.699     0.994531      1093935       182.86
       6.151     0.995313      1094794       213.33
       6.755     0.996094      1095653       256.00
       7.139     0.996484      1096082       284.44
       7.579     0.996875      1096511       320.00
       8.107     0.997266      1096942       365.71
       8.679     0.997656      1097375       426.67
       9.239     0.998047      1097801       512.00
       9.535     0.998242      1098019       568.89
       9.863     0.998437      1098234       640.00
      10.287     0.998633      1098444       731.43
      10.975     0.998828      1098658       853.33
      11.863     0.999023      1098875      1024.00
      12.479     0.999121      1098981      1137.78
      12.943     0.999219      1099090      1280.00
      13.335     0.999316      1099197      1462.86
      13.831     0.999414      1099303      1706.67
      14.863     0.999512      1099410      2048.00
      15.303     0.999561      1099466      2275.56
      15.943     0.999609      1099520      2560.00
      16.399     0.999658      1099574      2925.71
      17.439     0.999707      1099625      3413.33
      18.527     0.999756      1099679      4096.00
      19.151     0.999780      1099708      4551.11
      19.711     0.999805      1099733      5120.00
      20.159     0.999829      1099760      5851.43
      20.607     0.999854      1099787      6826.67
      20.975     0.999878      1099815      8192.00
      21.103     0.999890      1099827      9102.22
      21.295     0.999902      1099840     10240.00
      21.455     0.999915      1099854     11702.86
      21.567     0.999927      1099868     13653.33
      21.647     0.999939      1099880     16384.00
      21.711     0.999945      1099887     18204.44
      21.791     0.999951      1099894     20480.00
      21.903     0.999957      1099902     23405.71
      21.967     0.999963      1099907     27306.67
      21.983     0.999969      1099914     32768.00
      21.999     0.999973      1099918     36408.89
      22.015     0.999976      1099922     40960.00
      22.031     0.999979      1099924     46811.43
      22.063     0.999982      1099927     54613.33
      22.175     0.999985      1099931     65536.00
      22.191     0.999986      1099932     72817.78
      22.255     0.999988      1099936     81920.00
      22.255     0.999989      1099936     93622.86
      22.287     0.999991      1099937    109226.67
      22.319     0.999992      1099939    131072.00
      22.367     0.999993      1099940    145635.56
      22.383     0.999994      1099941    163840.00
      22.447     0.999995      1099942    187245.71
      22.447     0.999995      1099942    218453.33
      22.511     0.999996      1099943    262144.00
      22.543     0.999997      1099945    291271.11
      22.543     0.999997      1099945    327680.00
      22.543     0.999997      1099945    374491.43
      22.543     0.999998      1099945    436906.67
      22.543     0.999998      1099945    524288.00
      22.559     0.999998      1099947    582542.22
      22.559     1.000000      1099947          inf
#[Mean    =        1.226, StdDeviation   =        0.983]
#[Max     =       22.544, Total count    =      1099947]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1199997 requests in 2.00m, 1.41GB read
  Non-2xx or 3xx responses: 5
Requests/sec:   9999.89
Transfer/sec:     12.06MB